[{"id":"0.23543742300013304","title":"2022 Corvette ZR1 ","imageUrl":"https://static1.topspeedimages.com/wordpress/wp-content/uploads/2022/12/hennessey-corvette-zr1.jpg","description":"The 2022 Chevrolet Corvette ZR1 is a high-performance sports car with a focus on both speed and handling. It features a twin-turbocharged 5.5-liter V8 engine, generating 1,064 horsepower and 828 lb-ft of torque according to GM News. The ZR1 also utilizes extensive aerodynamics, including a high downforce carbon fiber rear wing, front dive planes, and other aerodynamic enhancements. It's equipped with carbon ceramic brakes for exceptional stopping power. ","price":"180000"},{"title":"Audi RS7","imageUrl":"https://www.topgear.com/sites/default/files/2023/07/ABT_RS7_LE%20%2824%29.jpg","description":"The Audi RS 7 is a high-performance hatchback sedan that blends luxury with incredible power and agility. It's powered by a 4.0-liter V8 biturbo TFSI engine, producing up to 621 horsepower, and can accelerate from 0 to 60 mph in just 3.3 seconds.","price":"128600","id":"0.2991700694907631"},{"id":"0.05830540724162625","title":"Toyota corolla 2022","imageUrl":"https://www.clickheretesting.com/SunriseToyota/research/2022/corolla/images/mlp-img-ext.jpg","description":"The stylish 2022 Toyota Corolla and efficient 2022 Toyota Corolla Hybrid take fun to the\r\nnext level. With a sleek design, the latest tech and standard Toyota Safety Sense™ 2.0 (TSS 2.0),\r\nthe 2022 Toyota Corolla lineup is ready to create something unforgettable","price":"32000"},{"id":"0.32871860117521834","title":"2025 Toyota Camry","imageUrl":"https://www.clickheretesting.com/HendrickToyotaFayetteville/research/2025/camry/images/mlp-img-ext.jpg","description":"The 2025 Toyota Camry features an all-hybrid powertrain, offering front-wheel drive (FWD) or all-wheel drive (AWD) options. The FWD models use a 2.5-liter four-cylinder engine paired with two electric motors, generating 225 horsepower. The AWD model adds a third electric motor to power the rear wheels, resulting in 232 horsepower. The 2025 Camry also boasts a refreshed exterior with a new front grille and updated LED headlights. A new XSE Nightshade Edition trim is available, featuring blacked-out accents and 19-inch black wheels. ","price":"40000"}]